app/controllers/comments_controller.rb

  def create
    story = Story.find(params[:story_id])
    @comment = story.comments.build(params[:comment]) if story
    @comment.user = current_user

    if @comment.save
---
SELECT "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("content", "created_at", "story_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "MyComment"], ["created_at", Thu, 24 May 2012 12:47:58 UTC +00:00], ["story_id", 1], ["updated_at", Thu, 24 May 2012 12:47:58 UTC +00:00], ["user_id", 1]]