app/controllers/stories_controller.rb

INSERT INTO "stories" ("content", "created_at", "owner_id", "requester_id", "state", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "My story"], ["created_at", Mon, 28 May 2012 14:30:27 UTC +00:00], ["owner_id", 102], ["requester_id", 101], ["state", "new"], ["updated_at", Mon, 28 May 2012 14:30:27 UTC +00:00]]
---
  def create
    @story = current_user.stories_out.build(params[:story])
    if @story.save

SELECT "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT 1  [["id", "2"]]
UPDATE "stories" SET "state" = 'accepted', "updated_at" = '2012-05-24 12:47:58.255117' WHERE "stories"."id" = 2
---
  def update
    story = Story.find(params[:id])
    story.state_event = params[:state_event] if story

    if story.save

SELECT "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT 1  [["id", "16"]]
DELETE FROM "stories" WHERE "stories"."id" = $1  [["id", 16]]
---
  def destroy
    story = Story.find(params[:id])
    story.destroy