app/controllers/users_controller.rb

  def index
    @users = User.page(params[:page]).per(21)
---
SELECT "users".* FROM "users" LIMIT 21 OFFSET 0
SELECT COUNT(*) FROM "users"

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("admin", "created_at", "email", "encrypted_password", "name", "salt", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
UPDATE "users" SET "name" = 'user 9', "email" = 'user-9@factory.com', "password_digest" = '$2a$10$GWUzGsyROL.dKZA7d21wd.E6nA8owOUOpcf0YNcJseS9T5zpu6hAi', "updated_at" = '2012-05-28 14:20:14.453905' WHERE "users"."id" = 56

  def destroy
    user = User.find(params[:id])
    if current_user?(user)
      flash[:error] = t 'flash.user.error_destroy_self'
    else
      user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = 345 LIMIT 1
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 92]]